{"pages":[{"title":"分类","text":"","link":"/categories/index.html"},{"title":"标签","text":"","link":"/tags/index.html"}],"posts":[{"title":"33岁的成功者","text":"知道自己要什么：​ 钱 学习不能落下对事物本质的认识能力和问题本质探究的敏锐度决定。 持之以恒的努力，和对世界进行认识。 学习是为了熟练，熟练是为了运用。不学习的其中一个目的，就是增强自己认识世界、发现事物本质的能力。 开阔的视野和持续发展的战略眼光。都是学习得来的。 工作、市场调研、前景分析。 1记住，大部分你认为不可控的事情，本身其实是可控的，只要你付出足够大的精力去认识它、了解它。运气？哪有什么运气，一步一个脚印生活，都是你自己踩出来。我也相信，如果有人能够付出跟我同样多的努力，他的未来一定不会差，我就敢如此断言。 作息最初创业时只能睡四五个小时。艰苦。 双份工 偷师，照顾公司。同时考上复旦研究生。 一般一天7到8个小时睡眠。 早上读书学习一小时，中午一小时。晚上写字一小时，读一个多小时书。 手机的碎片学习时间。 娱乐在这之外的其他时间。 1我想说，大学四年我不打游戏，连续两年时间都是双份工，一边给其他信息公司打工偷师一边经营自己的公司，连续三年时间每天睡眠只有4到5小时，偶尔会有6个小时，在把公司经营好的同时。我还考上呢复旦的研究生。你们扪心自问一下，你们真的有我这么拼命吗？ 命运​ 被命运打趴的人事少数。遭遇把自己打入尘埃的社会不公也是少数。 ​ 绝大多数是自己打趴自己——自己的恶习、懦弱、可怜而又薄弱的意志所打趴 畏惧寒冬，惧怕辛苦，意志薄弱，得过且过。总是差不多就好。自怨自艾，我曾努力过。 1事实上，这个世界被命运打趴的人永远是少数，毕竟这个世界上先天或后天的残疾者和重病者是少数，而遭遇到能把自己打入尘埃之程度的社会不公的也是少数。而绝大多数被打趴的人，是被自己打趴的——被自己的恶习、被自己的懦弱、被自己那可怜而又薄弱的意志所打败：他畏惧严冬，所以做不到5点半起床；他惧怕辛苦，所以做不到迎难而上；他意志薄弱，所以无法坚持自律；他得过且过，做什么事总是“差不多”就好；他自怨自艾，却从不自我反省；他自以为是，却从不自我审视。某天，他回头看看曾经的自己，甚至都不敢拍着胸脯说一句“我曾尽力过”。他觉得是命运不公，实际上他输的不冤。他要赢了，才真是命运不公。 一个对自己客观的认识1我觉得，正心诚意是关键。一个人首先要准确的认识自己，对自己有一个相对客观恰当的考量。你的现状如何？你自身优缺点是什么？你该如何准确的利用你的优势？又该如何对自己的劣势去改进？你未来想要什么样的生活？你该通过怎样的途径去接近并完成你未来想要的生活？诚恳的面对自己，搞明白这些问题，我觉得你对自己的大方向就有了一个基本的确认了 正心诚意是关键。要首先正确的认识自己。 现状不知道自己想要什么？钱吧？富有的生活。 一无所有，负债，没有经济来源，意志薄弱。 优点​ 善良，诚实，喜欢看鸡汤，可以理智分析问题。能动脑子。也经常反思自己。 缺点​ 无法接纳自己 ，自卑，懦弱，逃避，意志薄弱，该死的恶心的自尊，放不开，拉不下脸，不能坚持，得过且过，有欲望 对于自己身处的社会又缺乏一个相对客观正确的认识。 对自己实现欲望能力不自信，不自知；有盼望、有期待，却没有与之相符的目标方向、坚持和执行力。由此充满了对未来不可知的恐惧和厌恶，基于这种恐惧和厌恶，不自觉的无限放大了压力，于是整个人总是不断徘徊在坚持和放弃之间，以一种战战兢兢、迫不得已的心情面对着当下的生活工作和学习。如何能不心累？ 不要好高骛远、不要眼高手低、不要自欺，真诚的面对自己，客观正确的认识自己。根据自身最客观的实际情况找准方向，为自己确立长期目标和短期目标，不要被外界繁杂的信息影响自己的坚持，然后心无旁骛的去执行实现目标所需要的坚持。内心会逐渐轻松起来。 做出改变如何利用优势？多动脑子？ 如何改进劣势？真诚的面对自己，客观正确的认识自己。 短期目标：现在当务之急找到工作，与之并行的是自考4门课。 长期目标：继续学习专业知识3到5年成为专业工作者？ 终极目标：有钱，财务自由。 未来想要的生活爱情和富贵。 如何接近未来的生活一万小时定律如果每天工作八小时，一周5天，需要5年 40*50=2000 996需要三年而已，专业级工作者 60*50=3000 关于努力1一味埋头苦干是努力；一边埋头苦干、一边抬头看路也是努力；一边埋头苦干、一边抬头看路、一边造势成己，也是努力。但这几个努力，其境界与层次是完全不同的。 深厚的知识储备、对储备知识熟练的使用能力、开阔的思维和持续发展的战略眼光 这都是不辍的努力换来的。 1很多人只是看到一个人能够精准的选择出正确的创业方向、精准选择投资方向并获取盈利，但是他们不知道，这些“精准的选择”，都是通过长期不懈的理论学习、实践调查研究、经验总结而得到的。正所谓，台上十分钟，台下十年功，台上短短几分钟的几近完美的唱念做打，是台下数十年如一日的刻苦努力成就的。 1这个充满了机遇的现代社会中，绝大部分的人都是夭折于努力的过程中，而非夭折于天赋与时势。 1有没有比较努力去做一件事，但目前没什么成果的事。有，不仅我有，相信所有人都有。而且往往都是没有成果比有成果的次数要多很多。但这恰恰是一个认清方向、学习方法、总结经验的过程。失败是成功之母的道理就在这里了。 专一与广泛广博与专一需要辩证的统一。知识要有广度和宽度，也要有一个“专”的中心加以统帅。 要有专的根基。专的极致匠人？ 否则就只是碎片化的储备 专业问题的瓶颈解决途径，永远在专业之外。 吃苦穷根本不本不是吃苦，穷就是穷，不是吃苦。 吃苦并不是忍受贫穷屈辱的能力 吃苦的本质是： 123长时间为了一件事聚集的能力，以及在长时间聚焦的过程中，所放弃的娱乐生活、无效社交、无意义的物质物质消费等。以及在这个过程中所忍受的不被理解、排斥、拒绝和孤独。是一种禁欲能力、自控能力、坚持能力和深度思考、自我反思提升的能力 勤奋、忍受孤独、延迟满足、简单纯粹快乐充实。 之所以做不到，说到底吧，其实我觉得还是耐不住寂寞、经受不住主动学习的苦，而自我放弃而已。 多读书扩大知识范围，增加知识储备。没有强大知识储备的独立思考不是思考而是意淫 123为学习投资，为自己的头脑投资，永远都是最好的投资，当你到达一定阶层，你会发现，学习与知识所带来的价值远超你的想象。前程是自己的，不是别人的。自己想要什么样的未来在于你自己对世界具有怎样认识。 不会读书 读了就忘 一读到某个符合自身认知的新观点就立刻视为真理，缺少思辨、论证，相悖的则完全不能接纳 读书不以学习为目的，以批判为目的。 学会读书 粗读 细读：一个大概认识，偌有所感。 精读：逐句而学，扎扎实实，把每个概念、定理都要追根求源、彻底清楚，反复思考辨析，做批注、写读书笔记、做思辨过程的记录与分析，这叫把书读厚。 之后在此基础上分析归纳，抓住本质，把握整体，做到融会贯通，这叫把书读薄。 读一些数理、哲学的书籍、培养逻辑分析能力、理性思辨能力、反思能力、逐步养成抓问题本质的能力。 用历史、时政、经济训练判断分析力可以锻炼自己的信息接收能力与筛选能力，实践分析。验证自己的思考。时政， 123学习过程中发现问题、给自己提出问题，然后去寻找探究问题的初始与发展过程以及相关事件和资料，然后通过剥茧抽丝分析判断得出自己的结论，然后用自己的这个结论去比对现实最终客观结论，得出基本认识。同时，要做到比对但不盲从现实的最终客观结论，对现实的客观结论进行二次逻辑论证，只要资料考据翔实、事实依据清楚、发展脉络明了、符合逻辑规律，那么即使自己的结论与现实最终结论向左也要坚持个人结论、对现实最终结论勇于存疑。最后，还要记住一个事情：阶段性扎堆出现的经济问题、政治问题、文化问题，往往都不是孤立存在的，不要孤立的去判断问题。看问题要具备剥茧抽丝、从错综复杂的事件中抓住矛盾主线的能力。 质疑权威合理的考据，进行逻辑分析与论证，做出的合理合法的质疑。 训练日常表达在日常工作中清晰明确的表达出个人观点。训练你的及时反映能力、快速思维能力、判断力和决断力。 靠后发表观点和意见，多听多看多想。 1让别人去发表观点，然后你要思考别人的为什么是这个观点、这个观点对处在哪里，错处在哪里，同时思考他的观点是否为你提供了一个新的视角，这个新的视角是否会给你带来反思与自我审视。长此以往，会让你思考问题越来越全面，会逐渐培养出你的决策能力和领导能力，你会因此逐渐养成优秀的大局观，并逐渐在同学中成为主心骨和决策者。 潜意识集体无意识。 审视 ‘你的潜意识正在操控着你的人生，而你将其称为命运’ ‘当潜意识被察觉、被呈现，命运就被改写了’ ​ ——荣格 爱无能1234现代社会下，压力导致人愈加的焦虑、浮躁、寂寞，并由此引发“性有能而爱无能”。这种大前提下，就出现了这么一种社会现象有一部分青年，选择在一起并非是因为什么爱情，只不过是一直找不到自己称心如意的对象，而又需要有个人陪他（她）分担压力、缓解焦虑、安慰寂寞。于是，就选择找一个不讨厌、自己又觉得差不多的在一起处着，然后一边同居一边等符合自己幻想的人出现。当在同居这个过程中，如果符合自己幻想的人一直未出现、而“她”却不小心怀孕了，“他”也表示愿意负责时，于两家人就开始操持婚礼，一副其乐融融、喜庆吉祥的样子。令人悲伤的是，在这吉庆与皆大欢喜的表象之下，爱情其实从来没有到来过。 关于物质12345女人选择富足，很多时候，其实并非是在选择物质，而是在选择稳定与可靠。不要因此对女人有偏见，她们并没有错。稳定与可靠的生活是大部分女人毕生之追求。美好的一切建筑在现实之上，才坚不可摧。理想不是空中楼阁，要用手段去实现。空怀理想，没有手段，不过一待死腐儒而已。只有手段，而无没有理想，不过一行尸走肉罢了。人生在世，要怀抱美好，承认现实；当心存理想，善用手段。 end","link":"/01/33%E5%B2%81%E7%9A%84%E6%88%90%E5%8A%9F%E8%80%85.html"},{"title":"2019总结","text":"过去的2019大概回忆大二的最后一个学期在7月结束，也算是正式的告别的学生生涯。 7月加入了计算机培训，12月26日结束。 尝试投了几份简历，最后在宿舍一直窝到如今，借口是：等过年。 行吧，反正自己也说服不了自己。 那就过完年投简历吧 个人不知道说什么，学习不好，自己也不自觉。很早就有辍学的想法。磨磨蹭蹭现在要步入社会了。各种各样的借口也终于没有用了。 要开始赚钱了，还有些激动哈哈。拮据的日子终于要有所改善了吗！ 有些害怕社会大学给我当头一棒。怕什么，摆正心态。不要怂，就是干。 家没什么好谈的。爷爷奶奶的年纪越来越大。我不想陪在他们身边，却也确实感觉到了时间不停歇的流逝。我该怎么办，我不知道是期盼还是害怕那一天的到来。 我的亲人啊 工作​ 2020 是我工作元年，算是一个崭新的开始吧。还有什么样的大戏呢。 ​ 我定制一个工作上的目标，希望的3年5年后还在正轨上，我也确实没什么持之以恒的优良品质。 * 计算机行业、Java、 db 大数据 不能去别的地方 * 读一些计算机书籍，不断提高深度。 * 机智一点，灵活一点，努力提高双商。 * 好像也没别的了 2020 这一年现在进行时。 2020或许能决定2021 、2022 我的生活与走向。 个人12345- 健身- 好好吃，太弱了崽- 少开飞机，亡羊补牢吧。- 自考，熬过去。- 家人要好好的。 工作1- 能不跳槽就不想跳槽，好好干。多总结提升。 其他碎碎念 想学钢琴 想学心理学 想学金融理财 想学英语 想吃屁吧! 她 没什么资格，随缘吧。不过还是希望我们早点遇见啊。","link":"/01/2019%E6%80%BB%E7%BB%93.html"},{"title":"test","text":"一个商城项目整个项目采用分布式架构 V部落项目V部落是一个多用户博客管理平台，采用Vue+SpringBoot开发。 后端技术栈1.SpringBoot2.SpringSecurity3.MyBatis4.部分接口遵循Restful风格5.MySQL 步骤5中需要大家对NodeJS、NPM等有一定的使用经验，不熟悉的小伙伴可以先自行搜索学习下，推荐Vue官方教程。 前端技术栈1.Vue2.axios3.ElementUI4.vue-echarts5.mavon-editor6.vue-router 项目依赖1.vue-echarts2.mavonEditor 职业规划个人规划我是谁： 学习能力，计划能力 稳定性 结合公司发展 能否长久工作 工作 和 学习 工作方面，突出自己打算通过积极完成工作任务，积累各方面的经验，让自己成为这个领域的专业人士，也希望有机会能够带领团队，成为优秀的管理者，为单位做出更大贡献，获得双赢。 介绍自己认真思考过这个问题，自己的规划是基于目前的实际情况来设计的，不是凭空想的。 在学习方面，打算在专业领域做进一步学习和研究，将实践经验与专业知识相结合，为自己的职业成长做好铺垫，打好基础。 首先，自己认真思考过这个问题，自己的规划是基于目前的实际情况来设计的，不是凭空想的，自己毕竟刚毕业或者工作时间不长，经验还欠缺。 其次，在工作方面，我打算通过积极完成工作任务，积累各方面的经验，让自己成为这个领域的专业人士，也希望有机会能够带领团队，成为优秀的管理者，为单位做出更大贡献 第三，在学习方面，打算在专业领域做进一步学习和研究，将实践经验与专业知识相结合，为自己的职业成长做好铺垫，打好基础。谢谢！ 在我工作的这几年里，我一直都利用业余时间在学习新的技术方向，从A技术，到B技术，再到C技术，虽然工作上可能用的不多，但是我都去主动了解和学习，其中有一次还因为我懂C技术，在一个外包业务中为公司砍价看下来30%。而对于专业技术，我与王大雷、李大壮、张大强等技术大牛一直保持联系，不断提升自己的专业水平，确保能够应付公司产品部门提出的所有需求实现。 技术谈5年后，必须是专业， Tips：回答这个问题强调你稳定性，踏实工作的态度，重点在工作技能方面的提升与内在积累，不要描述外在的东西，比如职位，薪资。 所以，在回答职业规划的问题时，不要表现自己有多么厉害，而要表现自己靠谱、工作稳定、心态平和。 哪里来： 所以，我对自己的五年规划是一方面保持专业深度的不断提升，另一方面保持行业广度的不谈拓展，让自己有视野、有内涵、有前瞻、有承担，成为一名职场精英，并且密切配合公司对于岗位需要的调整和深化，持续提升自己的胜任力。相信无论是晋升、加薪，公司的机会都是留给有准备的人。咱们公司对于员工，应该也是有短期规划和长期规划的，对吧？ 目前我希望找到一份稳定的工作，累计工作经验，根据我对贵公司的了解，我觉得您提供的职位符合我的兴趣，同时我相信我的能力也能很好的匹配岗位需求。未来，我也有出国深造的计划，所以我会认真努力，争取在两年内做出成绩，一来为企业做贡献，二来也有利于我的留学申请。 我认为自己会一直投身在这个行业里，但是我希望自己能有更大的责任心，可以掌握更深层次的知识和先进讯息并扩展自己的技能体系。我会一直不断学习，不断完善自己，我希望五年以后通过自己的努力可以让我离成为该领域专家这个目标越来越近。 企业希望你有持续学习的热情，但前提是多学习自己所在岗位的技能，提升工作效率和质量，更好地在自己的工作岗位上发光发热，并且除了企业内部本身的培训之外，其他的学习不能占用工作时间，只能业余完成。 体现出你有在这个行业中成长的决心。面试官喜欢的应聘者是那种可以自我激励并且有内在的驱动力使他们不断成长为更好的自己的人员。 那里去： 如果有幸能来到中信证券这样全国顶级大平台，我一定会首先向周围优秀的同事们学习，学习中信的文化，通过努力追赶，让自己尽快从一个应届生转变为一个符合中信需求的职业化、专业化人才。 如果你应聘的是一程序员，那就谈谈如何把程序写好。 一个程序员，只要把技术提高上去，工作认真负责，保质保量的完成任务，之后的升职加薪自是水到渠成 梦想肯定是有的！但我觉得职位和薪酬都是你到那个水平，组织自然会考虑到的。所以现阶段我会把精力花费在努力提升自己的能力上，承担起应负担的责任，相信我能为组织作出相应的贡献时，一切都是水到渠成的。 面试前焦虑 不安 坐不住 胡思乱想 怕达不到月薪10k 不甘心 不愿意 要投机 1234主要担心：找不到工作。 实习问题要不要包装学历 ----购买 自己技术不好 不能胜任工作 工作肯定能找到。 薪资合适不合适。时间长短的煎熬","link":"/01/test.html"}],"tags":[{"name":"榜样","slug":"榜样","link":"/tags/%E6%A6%9C%E6%A0%B7/"},{"name":"人生思考","slug":"人生思考","link":"/tags/%E4%BA%BA%E7%94%9F%E6%80%9D%E8%80%83/"},{"name":"自我总结","slug":"自我总结","link":"/tags/%E8%87%AA%E6%88%91%E6%80%BB%E7%BB%93/"},{"name":"未来","slug":"未来","link":"/tags/%E6%9C%AA%E6%9D%A5/"},{"name":"目标","slug":"目标","link":"/tags/%E7%9B%AE%E6%A0%87/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"others","slug":"others","link":"/tags/others/"}],"categories":[{"name":"学习榜样","slug":"学习榜样","link":"/categories/%E5%AD%A6%E4%B9%A0%E6%A6%9C%E6%A0%B7/"},{"name":"自我总结","slug":"自我总结","link":"/categories/%E8%87%AA%E6%88%91%E6%80%BB%E7%BB%93/"},{"name":"test","slug":"test","link":"/categories/test/"}]}